---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionIWideFlange
source: html/936c276e-300a-621c-c5ff-036a17b43595.htm
---
# StructuralSectionIWideFlange Members

Creates a new instance of Structural Section I Wide Flange shape with the associated set of parameters,
 used to attach to structural element.